# FieldBuilder Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FieldBuilder Properties
FieldBuilder Class See Also
---
The FieldBuilder type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace